app/views/sequence/show.html.erb

    <ul>
      <% @sequence.poses.each do |pose| %>
---
SELECT "poses".* FROM "poses" INNER JOIN "sequence_poses" ON "poses"."id" = "sequence_poses"."pose_id" WHERE "sequence_poses"."sequence_id" = ?  [["sequence_id", 30]]