app/controllers/sequence_controller.rb

SELECT "sequences".* FROM "sequences"
---
  def index
    @sequences = Sequence.all

INSERT INTO "sequences" ("title", "difficulty", "repititions", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "New Title"], ["difficulty", 3], ["repititions", 3], ["created_at", "2016-12-26 22:27:32.087387"], ["updated_at", "2016-12-26 22:27:32.087387"]]
---
  def create
    @sequence = Sequence.create(title: sequence_params[:title], difficulty: sequence_params[:difficulty], repititions: sequence_params[:repititions])

SELECT  "sequences".* FROM "sequences" WHERE "sequences"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @sequence = Sequence.find(params[:id])

SELECT "sequences".* FROM "sequences"
---
  def set_sequences
    @sequences = Sequence.all